# Data Analysis - Cycle Share Data Set

## Author: Davee Sok

### July 15, 2021

In [124]:
import pandas as pd
import datetime as dt

In [151]:
station_df=pd.read_csv('station.csv')
station_df.head()

,station_id,name,lat,long,install_date,install_dockcount,modification_date,current_dockcount,decommission_date
0,BT-01,3rd Ave & Broad St,47.618418,-122.350964,10/13/2014,18,NaN,18,NaN
1,BT-03,2nd Ave & Vine St,47.615829,-122.348564,10/13/2014,16,NaN,16,NaN
2,BT-04,6th Ave & Blanchard St,47.616094,-122.341102,10/13/2014,16,NaN,16,NaN
3,BT-05,2nd Ave & Blanchard St,47.613110,-122.344208,10/13/2014,14,NaN,14,NaN
4,CBD-03,7th Ave & Union St,47.610731,-122.332447,10/13/2014,20,NaN,20,NaN

In [79]:
weather_df=pd.read_csv('weather.csv')
weather_df.head()

,Date,Max_Temperature_F,Mean_Temperature_F,Min_TemperatureF,Max_Dew_Point_F,MeanDew_Point_F,Min_Dewpoint_F,Max_Humidity,Mean_Humidity,Min_Humidity,...,Mean_Sea_Level_Pressure_In,Min_Sea_Level_Pressure_In,Max_Visibility_Miles,Mean_Visibility_Miles,Min_Visibility_Miles,Max_Wind_Speed_MPH,Mean_Wind_Speed_MPH,Max_Gust_Speed_MPH,Precipitation_In,Events
0,10/13/2014,71,62.0,54,55,51,46,87,68,46,...,29.79,29.65,10,10,4,13,4,21,0.00,Rain
1,10/14/2014,63,59.0,55,52,51,50,88,78,63,...,29.75,29.54,10,9,3,10,5,17,0.11,Rain
2,10/15/2014,62,58.0,54,53,50,46,87,77,67,...,29.71,29.51,10,9,3,18,7,25,0.45,Rain
3,10/16/2014,71,61.0,52,49,46,42,83,61,36,...,29.95,29.81,10,10,10,9,4,-,0.00,Rain
4,10/17/2014,64,60.0,57,55,51,41,87,72,46,...,29.78,29.73,10,10,6,8,3,-,0.14,Rain

In [156]:
trip_df=pd.read_csv('trip.csv', error_bad_lines=False)
trip_df.head(100)

/Users/DaveeSok/codefellows/py401/bike-stats/.venv/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3441: FutureWarning: The error_bad_lines argument has been deprecated and will be removed in a future version.


  exec(code_obj, self.user_global_ns, self.user_ns)
b'Skipping line 50794: expected 12 fields, saw 20\n'

,trip_id,starttime,stoptime,bikeid,tripduration,from_station_name,to_station_name,from_station_id,to_station_id,usertype,gender,birthyear
0,431,10/13/2014 10:31,10/13/2014 10:48,SEA00298,985.935,2nd Ave & Spring St,Occidental Park / Occidental Ave S & S Washing...,CBD-06,PS-04,Member,Male,1960.0
1,432,10/13/2014 10:32,10/13/2014 10:48,SEA00195,926.375,2nd Ave & Spring St,Occidental Park / Occidental Ave S & S Washing...,CBD-06,PS-04,Member,Male,1970.0
2,433,10/13/2014 10:33,10/13/2014 10:48,SEA00486,883.831,2nd Ave & Spring St,Occidental Park / Occidental Ave S & S Washing...,CBD-06,PS-04,Member,Female,1988.0
3,434,10/13/2014 10:34,10/13/2014 10:48,SEA00333,865.937,2nd Ave & Spring St,Occidental Park / Occidental Ave S & S Washing...,CBD-06,PS-04,Member,Female,1977.0
4,435,10/13/2014 10:34,10/13/2014 10:49,SEA00202,923.923,2nd Ave & Spring St,Occidental Park / Occidental Ave S & S Washing...,CBD-06,PS-04,Member,Male,1971.0
...,...,...,...,...,...,...,...,...,...,...,...,...
95,537,10/13/2014 12:54,10/13/2014 12:59,SEA00269,335.591,12th Ave & NE Campus Pkwy,NE 42nd St & University Way NE,UD-04,UD-02,Short-Term Pass Holder,NaN,NaN
96,538,10/13/2014 12:54,10/13/2014 13:15,SEA00464,1254.226,NE 42nd St & University Way NE,Children's Hospital / Sandpoint Way NE & 40th ...,UD-02,DPD-03,Member,Male,1987.0
97,539,10/13/2014 12:57,10/13/2014 13:04,SEA00308,425.148,Occidental Park / Occidental Ave S & S Washing...,1st Ave & Marion St,PS-04,CBD-05,Member,Female,1963.0
98,540,10/13/2014 12:58,10/13/2014 13:18,SEA00344,1189.182,2nd Ave & Pine St,2nd Ave & Pine St,CBD-13,CBD-13,Member,Male,1976.0
99,541,10/13/2014 12:59,10/13/2014 13:16,SEA00230,1003.336,Frye Art Museum / Terry Ave & Columbia St,Frye Art Museum / Terry Ave & Columbia St,FH-01,FH-01,Short-Term Pass Holder,NaN,NaN

# 1. What is the average trip duration for a borrowed bicycle?

In [81]:
average_trip_duration=trip_df['tripduration'].mean()
average_trip_duration

1178.2956753399776

# 2. What is the most common age of a bicycle-sharer?

In [82]:
most_common_age = 2021 - trip_df['birthyear'].value_counts().index[0]
most_common_age

34.0

# 3a. Find the average precipitation per month

In [101]:
# weather_df['Date'] = pd.to_datetime(weather_df['Date'])
weather_df['DATE'] = pd.to_datetime(weather_df['Date'])
precipitation_df = weather_df[['DATE', 'Precipitation_In']]
average_precipitation_per_month = precipitation_df.groupby(precipitation_df.DATE.dt.month).mean()
average_precipitation_per_month

      Precipitation_In
DATE
1             0.143548
2             0.168421
3             0.156935
4             0.051333
5             0.012419
6             0.030500
7             0.012097
8             0.018226
9             0.041000
10            0.189000
11            0.187833
12            0.236290

# 3a. Find the median precipitation per month

In [102]:
median_precipitation_per_month = precipitation_df.groupby(precipitation_df.DATE.dt.month).median()
median_precipitation_per_month

      Precipitation_In
DATE
1                0.020
2                0.040
3                0.025
4                0.000
5                0.000
6                0.000
7                0.000
8                0.000
9                0.000
10               0.040
11               0.035
12               0.100

# 4. Whats the average number of bikes at a given bike station?

In [140]:
bike_df = station_df[station_df['decommission_date'].isnull()][['station_id', 'current_dockcount']]
bike_df['current_dockcount'].mean()

17.74074074074074

# 5. When a bike station is modified, is it more likely that it’ll lose bikes or gain bikes? How do you know?

In [150]:
modified_stations = station_df[station_df['modification_date'].notnull()][['station_id', 'install_dockcount', 'modification_date', 'current_dockcount']]
modified_stations
install_count = modified_stations['install_dockcount'].sum()
current_count = modified_stations['current_dockcount'].sum()

if install_count > current_count:
  print('More likely go lose')
else:
  print('More likely to gain')

More likely go lose

# Stations are more likely to lose bikes after modifications because the data shows there are less bikes total after modification

# 6. Whats the average trip duration for females and males?

In [162]:
average_trip_duration_males = trip_df[trip_df['gender'] == "Male"][['tripduration']].mean().values[0]
average_trip_duration_females = trip_df[trip_df['gender'] == "Female"][['tripduration']].mean().values[0]
print(f'males average {average_trip_duration_males} seconds per trip')
print(f'females average {average_trip_duration_females} seconds per trip')

males average 564.8808333855042 seconds per trip
females average 706.723239444119 seconds per trip

# 7.